Autodesk.Revit.Exceptions.FunctionId.Function
The name of the function throwing an exception.

Autodesk.Revit.Exceptions.FunctionId.Line
The line number of the function throwing an exception.

Autodesk.Revit.Exceptions.FunctionId.File
The name of the file including the function throwing an exception.

Autodesk.Revit.Exceptions.FunctionId.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.FunctionId
The information of a function throwing an exception.